a = input('Введите фамилию:')
b = input('Введите имя:')
c = input('Введите группу:')
d = input('Введите город:')
while True:
    e = int(input('Введите возраст в полных годах:'))
    if 1 <= e <= 120:
        break
    else:
        print('Ошибка. Возраст — целое от 1 до 120')
f = input('Введите любимый предмет:')
while True:
    g = float(input('Введите количество часов подготовки в неделю:'))
    if g >= 0:
        break
    else:
        print('Ошибка. Часы — неотрицательное дробное число')

# c - name
# a - fam
e4 = e + 4  # cherez 4 goda
g4 = g * 4  # chasov 4 ned
g7 = g / 7 # sred v ned

print('-' * 56)
print(f'|                   Карточка студента                  |')
print('-' * 56)
print(f'|Имя Фамилия: {b} {a}')
print(f'|Возраст через 4 года: {e4}')
print(f'|Время подготовки за четыре недели: {g4:.2f} часов')
print(f'|Среднее время подготовки в день за неделю: {g7:.2f} часов')
print('-' * 56)

