a = input('Введите название первого предмета:')
while True:
    b = int(input('Количество занятий по первому предмету за неделю:'))
    if b >= 0:
        break
    else:
        print('Ошибка! Количество — целое неотрицательное число')

while True:
    c = int(input('Введите продолжительность одного занятия в минутах:'))
    if c > 0:
        break
    else:
        print('Ошибка! Продолжительности — положительное целое')

d = input('Введите название второго предмета:')
while True:
    e = int(input('Количество занятий по второму предмету за неделю:'))
    if e >= 0:
        break
    else:
        print('Ошибка! Количество — целое неотрицательное число')

while True:
    f = int(input('Введите продолжительность одного занятия в минутах:'))
    if f > 0:
        break
    else:
        print('Ошибка! Продолжительности — положительное целое')

pp = b * c
ppp = e * f

minut = (b * c + e * f)
chasi = (b * c + e * f) / 60

while True:
    g = float(input('Введите доступное время на неделю в часах:'))
    if g >= chasi:
        break
    else:
        print('Ошибка! Доступное время не должно быть меньше суммарной нагрузки')

poop = chasi * 4
ostatok = (g - chasi)

print(f'Время для первого предмета: {a} , {pp} минут')
print(f'Время для второго предмета: {d} , {ppp} минут')
print(f'Общая нагрузка в минутах и часах: {minut} минут , {chasi:.2f} часов')
print(f'Остаток свободного времени в часах: {ostatok:.2f} часов')
print(f'Нагрузку за четыре одинаковые недели: {poop:.2f} часов')
